In [1]:
import pandas as pd, numpy as np, matplotlib.pyplot as plt
from db_queries import get_ids
from db_queries import get_population as gpop

# Try out GBD population structure for binning

In [22]:
age_groups = get_ids("age_group")

In [65]:
single_years = [str(i) for i in np.arange(120)]
single_year_ids = age_groups[age_groups.age_group_name.isin(single_years)].age_group_id.tolist()

In [17]:
location_ids = get_ids("location")

In [33]:
location_ids[location_ids.location_id==102]

    location_id             location_name location_type location_description
85          102  United States of America        admin0               admin0

In [19]:
location_ids[location_ids.location_name=='Washington']

     location_id location_name location_type location_description
391          570    Washington        admin1               admin1

In [21]:
gpop

<function db_queries.get_population.get_population(age_group_id: Union[int, str, List[int]] = 22, single_year_age: bool = False, location_id: Union[int, str, List[int]] = 1, location_set_id: int = 35, location_set_version_id: int = 0, year_id: Union[int, str, List[int]] = None, sex_id: Union[int, str, List[int]] = 3, gbd_round_id: int = 7, status: str = 'best', run_id: int = 0, with_ui: bool = False, decomp_step: Union[str, NoneType] = None, forecasted_pop: bool = False) -> pandas.core.frame.DataFrame>

In [73]:
wa_pop = gpop(location_id = 570, year_id = 2010, single_year_age=True,
             gbd_round_id = 5, age_group_id = single_year_ids, sex_id = [1,2])

In [74]:
wa_pop = wa_pop.merge(age_groups, on = 'age_group_id', how = 'left').drop(columns=['age_group_id','run_id'])

In [75]:
wa_pop.head()

   location_id  year_id  sex_id    population age_group_name
0          570     2010       1  46026.738220              1
1          570     2010       1  46623.426707              2
2          570     2010       1  46496.609662              3
3          570     2010       1  45221.224961              4
4          570     2010       1  44543.890525              5

In [76]:
wa_pop.shape

(188, 5)

In [78]:
wa_pop.to_csv('gbd_WA_population_2010.csv', index = False)

In [79]:
pwd

'/ihme/homes/beatrixh/explore_census_2020_dp/explore/binning'